// 熟悉echarts地图配置。模仿 https://www.makeapie.com/editor.html?c=xJuu5c6jy9

// 地图散点数据源
export const  Guangxi_Map_Scatter_Data = [{
  name: "南宁市",
  value: 402,
},
{
  name: "柳州市",
  value: 4617,
},
{
  name: "桂林市",
  value: 4215,
},
{
  name: "梧州市",
  value: 4803,
},
{
  name: "北海市",
  value: 3343,
},
{
  name: "防城港市",
  value: 4631,
},
{
  name: "钦州市",
  value: 7127,
},
{
  name: "贵港市",
  value: 36,
},
{
  name: "玉林市",
  value: 136,
},
{
  name: "百色市",
  value: 7742,
},
{
  name: "贺州市",
  value: 4141,
},
{
  name: "河池市",
  value: 5899,
},
{
  name: "来宾市",
  value: 3766,
},
{
  name: "崇左市",
  value: 4108
}
];

export const gdGeoCoordMap = {
  "南宁市": [108.320004, 22.82402],
  "柳州市": [109.411703, 24.314617],
  "桂林市": [110.299121, 25.274215],
  "梧州市": [111.297604, 23.474803],
  "北海市": [109.119254, 21.473343],
  "防城港市": [108.345478, 21.614631],
  "钦州市": [108.624175, 21.967127],
  "贵港市": [109.602146, 23.0936],
  "玉林市": [110.154393, 22.63136],
  "百色市": [106.616285, 23.897742],
  "贺州市": [111.552056, 24.414141],
  "河池市": [108.062105, 24.695899],
  "来宾市": [109.229772, 23.733766],
  "崇左市": [107.353926, 22.404108]
};

